Roles/src/Enums/Roles_MetadataTypes/Roles_MetadataTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Roles_MetadataTypes</name>
  <enumValues>
    <name>AccountingRegister</name>
  </enumValues>
  <enumValues>
    <name>AccumulationRegister</name>
  </enumValues>
  <enumValues>
    <name>BusinessProcess</name>
  </enumValues>
  <enumValues>
    <name>CalculationRegister</name>
  </enumValues>
  <enumValues>
    <name>Catalog</name>
  </enumValues>
  <enumValues>
    <name>ChartOfAccounts</name>
  </enumValues>
  <enumValues>
    <name>ChartOfCalculationTypes</name>
  </enumValues>
  <enumValues>
    <name>ChartOfCharacteristicTypes</name>
  </enumValues>
  <enumValues>
    <name>CommonAttribute</name>
  </enumValues>
  <enumValues>
    <name>CommonCommand</name>
  </enumValues>
  <enumValues>
    <name>CommonForm</name>
  </enumValues>
  <enumValues>
    <name>Configuration</name>
  </enumValues>
  <enumValues>
    <name>Constant</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DocumentJournal</name>
  </enumValues>
  <enumValues>
    <name>Enum</name>
  </enumValues>
  <enumValues>
    <name>ExchangePlan</name>
  </enumValues>
  <enumValues>
    <name>ExternalDataSource</name>
  </enumValues>
  <enumValues>
    <name>FilterCriterion</name>
  </enumValues>
  <enumValues>
    <name>HTTPService</name>
  </enumValues>
  <enumValues>
    <name>InformationRegister</name>
  </enumValues>
  <enumValues>
    <name>IntegrationService</name>
  </enumValues>
  <enumValues>
    <name>Report</name>
  </enumValues>
  <enumValues>
    <name>Role</name>
  </enumValues>
  <enumValues>
    <name>Sequence</name>
  </enumValues>
  <enumValues>
    <name>SessionParameter</name>
  </enumValues>
  <enumValues>
    <name>Subsystem</name>
  </enumValues>
  <enumValues>
    <name>Task</name>
  </enumValues>
  <enumValues>
    <name>WebService</name>
  </enumValues>
  <enumValues>
    <name>Interface</name>
  </enumValues>
  <enumValues>
    <name>Language</name>
  </enumValues>
</mdclass:Enum>

Roles/src/Enums/Roles_MetadataSubtype/Roles_MetadataSubtype.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Roles_MetadataSubtype</name>
  <enumValues>
    <name>Attribute</name>
  </enumValues>
  <enumValues>
    <name>Dimension</name>
  </enumValues>
  <enumValues>
    <name>Resource</name>
  </enumValues>
  <enumValues>
    <name>StandardAttribute</name>
  </enumValues>
  <enumValues>
    <name>Command</name>
  </enumValues>
  <enumValues>
    <name>Recalculation</name>
  </enumValues>
  <enumValues>
    <name>AccountingFlag</name>
  </enumValues>
  <enumValues>
    <name>ExtDimensionAccountingFlag</name>
  </enumValues>
  <enumValues>
    <name>AddressingAttribute</name>
  </enumValues>
  <enumValues>
    <name>TabularSection</name>
  </enumValues>
  <enumValues>
    <name>StandardTabularSection</name>
  </enumValues>
  <enumValues>
    <name>Operation</name>
  </enumValues>
  <enumValues>
    <name>URLTemplate</name>
  </enumValues>
  <enumValues>
    <name>Method</name>
  </enumValues>
  <enumValues>
    <name>Cube</name>
  </enumValues>
  <enumValues>
    <name>Table</name>
  </enumValues>
  <enumValues>
    <name>DimensionTable</name>
  </enumValues>
  <enumValues>
    <name>Function</name>
  </enumValues>
  <enumValues>
    <name>Field</name>
  </enumValues>
</mdclass:Enum>

Roles/src/Enums/Roles_Rights/Roles_Rights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Roles_Rights</name>
  <enumValues>
    <name>ActiveUsers</name>
  </enumValues>
  <enumValues>
    <name>Administration</name>
  </enumValues>
  <enumValues>
    <name>AnalyticsSystemClient</name>
  </enumValues>
  <enumValues>
    <name>Automation</name>
  </enumValues>
  <enumValues>
    <name>CollaborationSystemInfoBaseRegistration</name>
  </enumValues>
  <enumValues>
    <name>ConfigurationExtensionsAdministration</name>
  </enumValues>
  <enumValues>
    <name>DataAdministration</name>
  </enumValues>
  <enumValues>
    <name>Delete</name>
  </enumValues>
  <enumValues>
    <name>Edit</name>
  </enumValues>
  <enumValues>
    <name>EditDataHistoryVersionComment</name>
  </enumValues>
  <enumValues>
    <name>EventLog</name>
  </enumValues>
  <enumValues>
    <name>ExclusiveMode</name>
  </enumValues>
  <enumValues>
    <name>ExclusiveModeTerminationAtSessionStart</name>
  </enumValues>
  <enumValues>
    <name>Execute</name>
  </enumValues>
  <enumValues>
    <name>ExternalConnection</name>
  </enumValues>
  <enumValues>
    <name>Get</name>
  </enumValues>
  <enumValues>
    <name>InputByString</name>
  </enumValues>
  <enumValues>
    <name>Insert</name>
  </enumValues>
  <enumValues>
    <name>InteractiveActivate</name>
  </enumValues>
  <enumValues>
    <name>InteractiveChangeOfPosted</name>
  </enumValues>
  <enumValues>
    <name>InteractiveClearDeletionMark</name>
  </enumValues>
  <enumValues>
    <name>InteractiveClearDeletionMarkPredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDelete</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDeleteMarked</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDeleteMarkedPredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDeletePredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveExecute</name>
  </enumValues>
  <enumValues>
    <name>InteractiveInsert</name>
  </enumValues>
  <enumValues>
    <name>InteractiveOpenExtDataProcessors</name>
  </enumValues>
  <enumValues>
    <name>InteractiveOpenExtReports</name>
  </enumValues>
  <enumValues>
    <name>InteractivePosting</name>
  </enumValues>
  <enumValues>
    <name>InteractivePostingRegular</name>
  </enumValues>
  <enumValues>
    <name>InteractiveSetDeletionMark</name>
  </enumValues>
  <enumValues>
    <name>InteractiveSetDeletionMarkPredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveStart</name>
  </enumValues>
  <enumValues>
    <name>InteractiveUndoPosting</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeEmbeddedWorkplace</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeFullscreenWorkplace</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeKiosk</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeNormal</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeWorkplace</name>
  </enumValues>
  <enumValues>
    <name>MobileClient</name>
  </enumValues>
  <enumValues>
    <name>Output</name>
  </enumValues>
  <enumValues>
    <name>Posting</name>
  </enumValues>
  <enumValues>
    <name>Read</name>
  </enumValues>
  <enumValues>
    <name>ReadDataHistory</name>
  </enumValues>
  <enumValues>
    <name>ReadDataHistoryOfMissingData</name>
  </enumValues>
  <enumValues>
    <name>SaveUserData</name>
  </enumValues>
  <enumValues>
    <name>SessionOSAuthenticationChange</name>
  </enumValues>
  <enumValues>
    <name>SessionStandardAuthenticationChange</name>
  </enumValues>
  <enumValues>
    <name>Set</name>
  </enumValues>
  <enumValues>
    <name>StandardAuthenticationChange</name>
  </enumValues>
  <enumValues>
    <name>Start</name>
  </enumValues>
  <enumValues>
    <name>SwitchToDataHistoryVersion</name>
  </enumValues>
  <enumValues>
    <name>TechnicalSpecialistMode</name>
  </enumValues>
  <enumValues>
    <name>ThickClient</name>
  </enumValues>
  <enumValues>
    <name>ThinClient</name>
  </enumValues>
  <enumValues>
    <name>TotalsControl</name>
  </enumValues>
  <enumValues>
    <name>UndoPosting</name>
  </enumValues>
  <enumValues>
    <name>Update</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataBaseConfiguration</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistory</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistoryOfMissingData</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistorySettings</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistoryVersionComment</name>
  </enumValues>
  <enumValues>
    <name>Use</name>
  </enumValues>
  <enumValues>
    <name>View</name>
  </enumValues>
  <enumValues>
    <name>ViewDataHistory</name>
  </enumValues>
  <enumValues>
    <name>WebClient</name>
  </enumValues>
</mdclass:Enum>

Roles/src/Catalogs/Roles_FunctionalOptions/Roles_FunctionalOptions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Roles_FunctionalOptions</name>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Configuration</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastHashUpdate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Content</name>
    <attributes>
      <name>ObjectType</name>
      <type>
        <types>EnumRef.Roles_MetadataTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightName</name>
      <type>
        <types>EnumRef.Roles_Rights</types>
      </type>
    </attributes>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ObjectPath</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightValue</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Disable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectSubtype</name>
      <type>
        <types>EnumRef.Roles_MetadataSubtype</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Roles/src/Catalogs/Roles_AccessRoles/Roles_AccessRoles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Roles_AccessRoles</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>SetRightsForNewNativeObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SetRightsForAttributesAndTabularSectionsByDefault</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SubordinateObjectsHaveIndependentRights</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ConfigRoles</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Configuration</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastHashUpdate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SetSeparateRightToStandardAttributes</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>ObjectType</name>
      <type>
        <types>EnumRef.Roles_MetadataTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightName</name>
      <type>
        <types>EnumRef.Roles_Rights</types>
      </type>
    </attributes>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ObjectPath</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightValue</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Disable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectSubtype</name>
      <type>
        <types>EnumRef.Roles_MetadataSubtype</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RestrictionByCondition</name>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Fields</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>FilterDataStorage</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Templates</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Template</name>
      <type>
        <types>CatalogRef.Roles_Templates</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LangInfo</name>
    <attributes>
      <name>LangCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>LangDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Roles/src/CommonModules/Roles_ExportAndLoadCurrentRoles/Module.bsl
#Region Internal
Procedure UpdateRoleExt(Val Settings, CountRoles = 0, CountFO = 0, Log = "") Export
	LoadFromTemp = False;
	If Settings.Source = "SQL"
		Or Settings.Source = "File" Then
			
		Path = TempFilesDir() + "TR";
		
		DeleteFiles(Path);
		CreateDirectory(Path);
		LoadFromTemp = True;
		// unload to xml
		CommandToUploadExt = """" + BinDir() + "1cv8.exe"" designer " + "/N """ + Settings.Login + """" +
			" /P """ + Settings.Password + """" + " " + 
			?(Settings.Source = "SQL", "/s " + Settings.ServerName + "\" + Settings.BaseName, "/f " + Settings.Path) +
			" /DumpConfigToFiles " + Path + " /DumpResult " + Path + 
			"\Result.log /DisableStartupMessages /DisableStartupDialogs /Out " + Path + "\Event.log";
		RunApp(CommandToUploadExt, , True);
		
		TextReader = New TextReader();
		TextReader.Open(Path + "\Event.log", TextEncoding.UTF8);
		Log = TextReader.Read();
		TextReader.Close();

		TextReader = New TextReader();
		TextReader.Open(Path + "\Result.log", TextEncoding.UTF8);
		Status = TextReader.Read();
		TextReader.Close();

		If Not Status = "0" Then
			Log = Log + Chars.LF + "Status = " + Status;
			Return;
		EndIf;
		Settings.PathToXML = Path + "\";
	EndIf;
	
	
	
	Rights = FindFiles(Settings.PathToXML + "Roles", "*.xml", False);	
	LoadRolesFromXMLFormat(Settings, Rights);
	
	CountRoles = Rights.Count();
	
	Rights = FindFiles(Settings.PathToXML + "Roles", "*.mdo", True);		
	LoadRolesFromEDTFormat(Settings, Rights);
	
	CountRoles = CountRoles + Rights.Count();
	
	FunctionalOptions = FindFiles(Settings.PathToXML + "FunctionalOptions", "*.mdo", True);		
	LoadFunctionalOptionsFromEDTFormat(Settings, FunctionalOptions);
	CountFO = FunctionalOptions.Count();
	
	Forms = FindFiles(Settings.PathToXML, "*.form", True);		
	Log = Log + Chars.LF + LoadFunctionalOptionsFromEDTFormatForms(Settings, Forms, Log);
	
	If LoadFromTemp Then	
		DeleteFiles(Path);
	EndIf;	
EndProcedure
#EndRegion

#Region Private

Function LoadFunctionalOptionsFromEDTFormatForms(Settings, Val Forms, Log)
	
	Map = New Map;
	FORef = Catalogs.Roles_FunctionalOptions.Select();
	While FORef.Next() Do
		Map.Insert("FunctionalOption." + FORef.Description, New Structure("Obj, Updated", FORef.GetObject(), False))
	EndDo;
	
	ErrorsArray = New Array;
	For Each Form In Forms Do
		TextReader = New TextReader();
		TextReader.Open(Form.FullName, TextEncoding.UTF8);
		Text = TextReader.Read();
		TextReader.Close();
		If StrFind(Text, "<functionalOptions>") = 0 Then
			Continue;
		EndIf;
		
		XML = New XMLReader();
		XML.SetString(Text);
		
		FormInfo = New DOMBuilder(); 
		XMLData = FormInfo.Read(XML);
		XML.Close();
		
		ListFO = XMLData.GetElementByTagName("functionalOptions");
		
		For Each FORow In ListFO Do
			FO = Map.Get(FORow.TextContent);
			If FO = Undefined Then
				ErrorsArray.Add("Functional option: " + FORow.TextContent + ", not found. But using in: " + Form.FullName);
				Continue;
			EndIf;
			FO.Updated = True;
			NewForm = FO.Obj.FormContent.Add();
			PathData = StrSplit(Form.Path, "\/", False);
			NewForm.FormName = PathData[PathData.UBound()];
			
			If Not PathData[PathData.UBound() - 1] = "CommonForms" Then
				NewForm.ObjectName = PathData[PathData.UBound() - 2];
				NewForm.ObjectType = Enums.Roles_MetadataTypes[Left(PathData[PathData.UBound() - 3], StrLen(PathData[PathData.UBound() - 3]) - 1)];
			Else
				NewForm.ObjectType = Enums.Roles_MetadataTypes.CommonForm;
			EndIf;
			If FORow.ParentNode.TagName = "formCommands" Then
				For Each CN In FORow.ParentNode.ChildNodes Do
					If CN.NodeName = "name" Then
						NewForm.ObjectPath = CN.TextContent;
						NewForm.ObjectSubtype = Enums.Roles_MetadataSubtype.Command;
						Break;
					EndIf;
				EndDo;
			ElsIf FORow.ParentNode.TagName = "attributes" Then
				For Each CN In FORow.ParentNode.ChildNodes Do
					If CN.NodeName = "name" Then
						NewForm.ObjectPath = CN.TextContent;
						NewForm.ObjectSubtype = Enums.Roles_MetadataSubtype.Attribute;
						Break;
					EndIf;
				EndDo;
			ElsIf FORow.ParentNode.TagName = "columns" Then
				For Each CN In FORow.ParentNode.ParentNode.ChildNodes Do
					If CN.NodeName = "name" Then
						NewForm.ObjectPath = CN.TextContent;
						NewForm.ObjectSubtype = Enums.Roles_MetadataSubtype.Table;
						Break;
					EndIf;
				EndDo;
				For Each CN In FORow.ParentNode.ChildNodes Do
					If CN.NodeName = "name" Then
						NewForm.ObjectPath = NewForm.ObjectPath + "." + CN.TextContent;
						NewForm.ObjectSubtype = Enums.Roles_MetadataSubtype.Table;
						Break;
					EndIf;
				EndDo;
			Else
				ErrorsArray.Add("Functional option: " + FORow.TextContent + ", Undefined tag content:" + FORow.ParentNode.TagName + " In : " + Form.FullName);
			EndIf;
		EndDo;
		
	EndDo;
	
	For Each VK In Map Do
		If VK.Value.Updated Then
			VK.Value.Obj.Write();
		EndIf;
	EndDo;
	
	Return StrConcat(ErrorsArray, Chars.LF);
EndFunction

Procedure LoadFunctionalOptionsFromEDTFormat(Settings, Val FunctionalOptions)

	For Each FO In FunctionalOptions Do
		TextReader = New TextReader();
		TextReader.Open(FO.FullName, TextEncoding.UTF8);
		Text = TextReader.Read();
		TextReader.Close();
		CurrentHash = Roles_ServiceServer.HashMD5(Text);
		
		FunctionalOptionInfo = Roles_ServiceServer.DeserializeXMLUseXDTOFactory(Text);
		
		UUID = New UUID(FunctionalOptionInfo.uuid);
		
		FunctionalOptionRef = Catalogs.Roles_FunctionalOptions.GetRef(UUID);
		If FunctionalOptionRef.Description = "" Then
			FunctionalOptionObject = Catalogs.Roles_FunctionalOptions.CreateItem();
			FunctionalOptionObject.SetNewObjectRef(FunctionalOptionRef);
		Else
//			If FunctionalOptionRef.LastHashUpdate = CurrentHash Then
//				Continue;
//			EndIf;

			FunctionalOptionObject = FunctionalOptionRef.GetObject();
		EndIf;
		
		FunctionalOptionObject.LastHashUpdate = CurrentHash;
		FunctionalOptionObject.AdditionalProperties.Insert("Update");
		
		CurrentHash = Roles_ServiceServer.HashMD5(Roles_ServiceServer.SerializeXML(FunctionalOptionObject));
		
		FunctionalOptionObject.Content.Clear();
		FunctionalOptionObject.LangInfo.Clear();
		FunctionalOptionObject.FormContent.Clear();
		
		FunctionalOptionObject.Description = FunctionalOptionInfo.Name;
		FunctionalOptionObject.Location = FunctionalOptionInfo.Location;
		If Not FunctionalOptionInfo.Properties().Get("Synonym") = Undefined Then	
			If TypeOf(FunctionalOptionInfo.Synonym) = Type("XDTODataObject") Then
				Lang = FunctionalOptionInfo.Synonym;
				NewLang = FunctionalOptionObject.LangInfo.Add();
				NewLang.LangCode = Lang.key;
				NewLang.LangDescription = Lang.value;
			Else
				For Each Lang In FunctionalOptionInfo.Synonym Do
					NewLang = FunctionalOptionObject.LangInfo.Add();
					NewLang.LangCode = Lang.key;
					NewLang.LangDescription = Lang.value;
				EndDo;
			EndIf;
		EndIf;
		If Not FunctionalOptionInfo.Properties().Get("Comment") = Undefined Then
			FunctionalOptionObject.Comment = FunctionalOptionInfo.Comment;
		Else
			FunctionalOptionObject.Comment = "";
		EndIf;
		
		If Not FunctionalOptionInfo.Properties().Get("content") = Undefined Then	
			If TypeOf(FunctionalOptionInfo.content) = Type("String") Then
				Content = FunctionalOptionInfo.Content;
				NewContent = FunctionalOptionObject.Content.Add();
				NewContent.RowID = New UUID();
				NewContent.ObjectPath = Content;
				
				ObjectFullName = StrSplit(Content, ".", False);
				NewContent.ObjectType = Enums.Roles_MetadataTypes[ObjectFullName[0]];
				NewContent.ObjectName = ObjectFullName[1];	
				If ObjectFullName.Count() > 2 Then
					If Not ObjectFullName[2] = "Subsystem" Then
						NewContent.ObjectSubtype = Enums.Roles_MetadataSubtype[ObjectFullName[2]];
					EndIf;
				EndIf;
			Else
				For Each Content In FunctionalOptionInfo.content Do
					NewContent = FunctionalOptionObject.Content.Add();
					NewContent.RowID = New UUID();
					NewContent.ObjectPath = Content;
					
					ObjectFullName = StrSplit(Content, ".", False);
					NewContent.ObjectType = Enums.Roles_MetadataTypes[ObjectFullName[0]];
					NewContent.ObjectName = ObjectFullName[1];	
					If ObjectFullName.Count() > 2 Then
						If Not ObjectFullName[2] = "Subsystem" Then
							NewContent.ObjectSubtype = Enums.Roles_MetadataSubtype[ObjectFullName[2]];
						EndIf;
					EndIf;
				EndDo;
			EndIf;
		EndIf;
		
		NewHash = Roles_ServiceServer.HashMD5(Roles_ServiceServer.SerializeXML(FunctionalOptionObject));
		
		If Not CurrentHash = NewHash Then
			FunctionalOptionObject.Write();
		EndIf;
	EndDo;
EndProcedure


Procedure LoadRolesFromEDTFormat(Settings, Val Rights)

	For Each Right In Rights Do
		TextReader = New TextReader();
		TextReader.Open(Right.FullName, TextEncoding.UTF8);
		Text = TextReader.Read();
		TextReader.Close();
		CurrentHash = Roles_ServiceServer.HashMD5(Text);
		
		RoleInfo = Roles_ServiceServer.DeserializeXMLUseXDTOFactory(Text);
		
		UUID = New UUID(RoleInfo.uuid);
		
		RightRef = Catalogs.Roles_AccessRoles.GetRef(UUID);
		If RightRef.Description = "" Then
			RightObject = Catalogs.Roles_AccessRoles.CreateItem();
			RightObject.SetNewObjectRef(RightRef);
		Else
			If RightRef.LastHashUpdate = CurrentHash Then
				Continue;
			EndIf;

			RightObject = RightRef.GetObject();
		EndIf;
		
		RightObject.LastHashUpdate = CurrentHash;
		RightObject.AdditionalProperties.Insert("Update");
		
		CurrentHash = Roles_ServiceServer.HashMD5(Roles_ServiceServer.SerializeXML(RightObject));
		
		RightObject.Rights.Clear();
		RightObject.LangInfo.Clear();
		RightObject.RestrictionByCondition.Clear();
		RightObject.Templates.Clear();
		
		RightObject.Description = RoleInfo.Name;
		RightObject.ConfigRoles = True;
		If Not RoleInfo.Properties().Get("Synonym") = Undefined Then	
			If TypeOf(RoleInfo.Synonym) = Type("XDTODataObject") Then
				Lang = RoleInfo.Synonym;
				NewLang = RightObject.LangInfo.Add();
				NewLang.LangCode = Lang.key;
				NewLang.LangDescription = Lang.value;
			Else
				For Each Lang In RoleInfo.Synonym Do
					NewLang = RightObject.LangInfo.Add();
					NewLang.LangCode = Lang.key;
					NewLang.LangDescription = Lang.value;
				EndDo;
			EndIf;
		EndIf;
		If Not RoleInfo.Properties().Get("Comment") = Undefined Then
			RightObject.Comment = RoleInfo.Comment;
		Else
			RightObject.Comment = "";
		EndIf;
		
		TextReader = New TextReader();
		TextReader.Open(Settings.PathToXML + "Roles\" + RightObject.Description + "\Rights.rights", TextEncoding.UTF8);
		Text = TextReader.Read();
		TextReader.Close();
		
		LoadRightsToDB(RightObject, Text);
		
		NewHash = Roles_ServiceServer.HashMD5(Roles_ServiceServer.SerializeXML(RightObject));
		
		If Not CurrentHash = NewHash Then
			RightObject.Write();
		EndIf;
	EndDo;
EndProcedure

Procedure LoadRightsToDB(RightObject, Text)

	Try
		RightInfo = Roles_ServiceServer.DeserializeXMLUseXDTOFactory(Text);
	Except
		// Try to make lower version
		VersionIndex = StrFind(Text, "version=" + Char(34), , StrFind(Text, "Rights"));
		VersioneEndIndex = StrFind(Text, Char(34), , VersionIndex + 9) + 1;
		Version = Mid(Text, VersionIndex, VersioneEndIndex - VersionIndex);
		Text = StrReplace(Text, Version, "version=""2.8""");	
		RightInfo = Roles_ServiceServer.DeserializeXMLUseXDTOFactory(Text);
	EndTry;
	
	RightObject.SetRightsForAttributesAndTabularSectionsByDefault = 
		RightInfo.setForAttributesByDefault;
	RightObject.SetRightsForNewNativeObjects = 
		RightInfo.setForNewObjects;
	RightObject.SubordinateObjectsHaveIndependentRights = 
		RightInfo.independentRightsOfChildObjects;
	
	For Each Object In RightInfo.object Do
		ObjectFullName = StrSplit(Object.Name, ".", False);
		ObjectType = Enums.Roles_MetadataTypes[ObjectFullName[0]];
		ObjectName = ObjectFullName[1];		
		For Each ObjectRight In Object.right Do
			NewObject = RightObject.Rights.Add();
			NewObject.ObjectName = ObjectName;
			NewObject.ObjectType = ObjectType;
			NewObject.ObjectPath = Object.Name;
			If ObjectFullName.Count() > 2 Then
				If Not ObjectFullName[2] = "Subsystem" Then
					NewObject.ObjectSubtype = Enums.Roles_MetadataSubtype[ObjectFullName[2]];
				EndIf;
			EndIf;
			If ObjectRight.name = "AllFunctionsMode" Then
				NewObject.RightName = Enums.Roles_Rights.TechnicalSpecialistMode;
			Else
				NewObject.RightName = Enums.Roles_Rights[ObjectRight.name];
			EndIf;
			
			NewObject.RowID = New UUID();
			NewObject.RightValue = ObjectRight.value;
			For Each RestrictionByCondition In ObjectRight.restrictionByCondition Do
				Condition = RightObject.RestrictionByCondition.Add();
				Condition.RowID = NewObject.RowID;
				Condition.Condition = RestrictionByCondition.condition;
			EndDo;
			
		EndDo;
	EndDo;
	For Each restrictionTemplate In RightInfo.restrictionTemplate Do
		Condition = RightObject.Templates.Add();
		Condition.Name = restrictionTemplate.Name;
		
		TemplateUUID = New UUID(Roles_ServiceServer.HashMD5(restrictionTemplate.condition));
		TemplateRef  = Catalogs.Roles_Templates.GetRef(TemplateUUID);
		
		If TemplateRef.Description = "" Then
			TemplateObject = Catalogs.Roles_Templates.CreateItem();
			TemplateObject.Description = restrictionTemplate.Name;
			TemplateObject.Template = restrictionTemplate.condition;
			TemplateObject.SetNewObjectRef(TemplateRef);
			
			If NOT Catalogs.Roles_Templates.FindByDescription(restrictionTemplate.Name).IsEmpty() Then
				TemplateObject.Description = TemplateObject.Description + "(" + RightObject.Description + ")";
			EndIf;
			
			TemplateObject.Write();
			TemplateRef = TemplateObject.Ref;
		EndIf;
		
		Condition.Template = TemplateRef;
	EndDo;
EndProcedure

Procedure LoadRolesFromXMLFormat(Settings, Val Rights)

	For Each Right In Rights Do
		TextReader = New TextReader();
		TextReader.Open(Right.FullName, TextEncoding.UTF8);
		Text = TextReader.Read();
		TextReader.Close();
		
		CurrentHash = Roles_ServiceServer.HashMD5(Text);
		
		RoleInfo = Roles_ServiceServer.DeserializeXMLUseXDTOFactory(Text);
		
		UUID = New UUID(RoleInfo.Role.uuid);
		
		RightRef = Catalogs.Roles_AccessRoles.GetRef(UUID);
		If RightRef.Description = "" Then
			RightObject = Catalogs.Roles_AccessRoles.CreateItem();
			RightObject.SetNewObjectRef(RightRef);
		Else
			If RightRef.LastHashUpdate = CurrentHash Then
				Continue;
			EndIf;
			RightObject = RightRef.GetObject();
		EndIf;
		
		RightObject.LastHashUpdate = CurrentHash;
		
		RightObject.AdditionalProperties.Insert("Update");		
		RightObject.Rights.Clear();
		RightObject.LangInfo.Clear();
		RightObject.RestrictionByCondition.Clear();
		RightObject.Templates.Clear();
		
		RightObject.Description = RoleInfo.Role.Properties.Name;
		RightObject.ConfigRoles = True;
		
		If Not RoleInfo.Role.Properties.Synonym.Properties().Get("Item") = Undefined Then
			If TypeOf(RoleInfo.Role.Properties.Synonym.item) = Type("XDTODataObject") Then
				Lang = RoleInfo.Role.Properties.Synonym.item;
				NewLang = RightObject.LangInfo.Add();
				NewLang.LangCode = Lang.lang;
				NewLang.LangDescription = Lang.Content;
			Else
				For Each Lang In RoleInfo.Role.Properties.Synonym.item Do
					NewLang = RightObject.LangInfo.Add();
					NewLang.LangCode = Lang.lang;
					NewLang.LangDescription = Lang.Content;
				EndDo;
			EndIf;
		EndIf;
		If TypeOf(RoleInfo.Role.Properties.Comment) = Type("String") Then
			RightObject.Comment = RoleInfo.Role.Properties.Comment;
		Else
			RightObject.Comment = "";
		EndIf;
		
		TextReader = New TextReader();
		TextReader.Open(Settings.PathToXML + "Roles\" + RightObject.Description + "\Ext\Rights.xml", TextEncoding.UTF8);
		Text = TextReader.Read();
		TextReader.Close();
		
		LoadRightsToDB(RightObject, Text);
		RightObject.Write();
	EndDo;
EndProcedure
#EndRegion
